###################### 程序开始 ######################
n = 1   # n表示当前项的数值
s = 0   # s是累加求和变量
############### 编写下面的while循环代码 ###############

while n<100:
    if(n%2==0):
        n-=1
        s-=n
    else:
        n+=1
        s+=n
print(s)  #输出计算结果s

###################### 程序结束 ######################

###################### 程序开始 ######################

n = 0  # 从测试集读取正整数n
p = 1  # p为阶乘结果，初始值=1
i = 1  # i为循环变量
############### 编写下面的while循环代码 ###############

while i < n:
    i += 1
    p = p * i

print("%d!=%d" % (n, p))  # 输出n的阶乘

###################### 程序结束 ######################

